docs/physics/thermodynamics.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thermodynamics</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Thermodynamics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-349eb31f-1ee7-4c39-b8d8-a54a1a2be4e2">1. Introduction</a>
<ul>
<li><a href="#h-527fdb37-a1cd-411c-831a-bff5da507df4">1.1. Definition: Thermodynamic System, Environment</a></li>
<li><a href="#h-a6fab8d7-8fea-49f1-b554-4ad50e01b2b7">1.2. Definition: State Variables</a></li>
<li><a href="#h-f5bc77ee-0973-49c5-82ae-e674ac4b9594">1.3. Definition: Thermal Equilibrium</a></li>
<li><a href="#h-2db30d0b-dc1c-47fa-adbd-79f70c97f30c">1.4. Zeroth Law of Thermodynamics</a></li>
<li><a href="#h-694761e8-12ad-4e60-a1c7-b49ad6269799">1.5. Ideal Gas Law</a></li>
</ul>
</li>
<li><a href="#h-abeb6b71-d994-43cb-bf9c-2f37c4b614e7">2. Statistical Mechanics</a></li>
</ul>
</div>
</div>
<div id="outline-container-h-349eb31f-1ee7-4c39-b8d8-a54a1a2be4e2" class="outline-2">
<h2 id="h-349eb31f-1ee7-4c39-b8d8-a54a1a2be4e2"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-349eb31f-1ee7-4c39-b8d8-a54a1a2be4e2">
<p>
Thermodynamics introduces new physical quantities (namely, temperature
and heat). The first thing we need to do: construct an apparatus to
measure temperature. A "thermometer", if you will. Towards that end, we
need to introduce the zeroth law of thermodynamics.
</p>
</div>
<div id="outline-container-h-527fdb37-a1cd-411c-831a-bff5da507df4" class="outline-3">
<h3 id="h-527fdb37-a1cd-411c-831a-bff5da507df4"><span class="section-number-3">1.1.</span> Definition: Thermodynamic System, Environment</h3>
<div class="outline-text-3" id="text-h-527fdb37-a1cd-411c-831a-bff5da507df4">
<p>
A <dfn>Thermodynamic System</dfn> (or just <dfn>System</dfn>) is a
collection of matter and/or radiation, confined spatially by some
barrier separating it from its <dfn>Environment</dfn>.
</p>
</div>
</div>
<div id="outline-container-h-a6fab8d7-8fea-49f1-b554-4ad50e01b2b7" class="outline-3">
<h3 id="h-a6fab8d7-8fea-49f1-b554-4ad50e01b2b7"><span class="section-number-3">1.2.</span> Definition: State Variables</h3>
<div class="outline-text-3" id="text-h-a6fab8d7-8fea-49f1-b554-4ad50e01b2b7">
<p>
We describe a thermodynamic system by means of certain physical
quantities called <dfn>State Variables</dfn>.
</p>

<ul class="org-ul">
<li>Extensive state variables are directly proportional to the size of the
system. Examples: mass, energy, volume.</li>
<li>Intensive state variables are not. Examples: density \(\rho\),
temperature, hardness.</li>
</ul>

<p>
This division between intensive and extensive state variables make sense
within thermodynamics, but clever people may invent quantities which are
neither intensive nor extensive (e.g., the squareroot of volume).
</p>
</div>
</div>
<div id="outline-container-h-f5bc77ee-0973-49c5-82ae-e674ac4b9594" class="outline-3">
<h3 id="h-f5bc77ee-0973-49c5-82ae-e674ac4b9594"><span class="section-number-3">1.3.</span> Definition: Thermal Equilibrium</h3>
<div class="outline-text-3" id="text-h-f5bc77ee-0973-49c5-82ae-e674ac4b9594">
<p>
We will say a system is in <dfn>Thermodynamic Equilibrium</dfn> if its
temperature is approximately the same everywhere within the system.
</p>

<p>
Different authors give different variations of the definition (e.g., the
<i>variance</i> of the temperature is "small" compared to the mean temperature).
</p>
</div>
</div>
<div id="outline-container-h-2db30d0b-dc1c-47fa-adbd-79f70c97f30c" class="outline-3">
<h3 id="h-2db30d0b-dc1c-47fa-adbd-79f70c97f30c"><span class="section-number-3">1.4.</span> Zeroth Law of Thermodynamics</h3>
<div class="outline-text-3" id="text-h-2db30d0b-dc1c-47fa-adbd-79f70c97f30c">
<p>
When two thermodynamic systems are in contact, they will eventually
reach thermodynamic equilibrium.
</p>

<p>
If we have three thermodynamic systems (call them A, B, and C) such that
A is in contact with B and B is in contact with C, then eventually they
will reach thermodynamic equilibrium with one another. In particular, A
will be in thermodynamic equilibrium with C.
</p>

<p>
Phrased differently, "is in thermodynamic equilibrium with" is a
transitive relation.
</p>
</div>
</div>
<div id="outline-container-h-694761e8-12ad-4e60-a1c7-b49ad6269799" class="outline-3">
<h3 id="h-694761e8-12ad-4e60-a1c7-b49ad6269799"><span class="section-number-3">1.5.</span> Ideal Gas Law</h3>
<div class="outline-text-3" id="text-h-694761e8-12ad-4e60-a1c7-b49ad6269799">
<p>
Many physical systems may be approximated by the ideal-gas law:
</p>

\begin{equation}
pV = nRT
\end{equation}

<p>
where:
</p>

<ul class="org-ul">
<li>\(p\) is the pressure of the gas</li>
<li>\(V\) is the volume of the gas</li>
<li>\(n\) is the number of moles of gas</li>
<li>\(R\) is the universal gas constant</li>
<li>\(T\) is the temperature of the gas.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-h-abeb6b71-d994-43cb-bf9c-2f37c4b614e7" class="outline-2">
<h2 id="h-abeb6b71-d994-43cb-bf9c-2f37c4b614e7"><span class="section-number-2">2.</span> Statistical Mechanics</h2>
<div class="outline-text-2" id="text-h-abeb6b71-d994-43cb-bf9c-2f37c4b614e7">
<p>
We can derive many results in thermodynamics using a "microscopic" or
"molecular" perspective. This is precisely statistical mechanics. (We
can also use computers and <a href="https://en.wikipedia.org/wiki/Molecular_dynamics">molecular dynamics</a> nowadays &#x2014; see, e.g.,
Rapaport's <cite class="book-title">The Art of Molecular Dynamics Simulation</cite>.)
</p>

<p>
Most books will jump into quantum statistical mechanics, but there are a
few which discuss classical derivations: Greiner, Huang, and a few
others spring to mind.</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Sat, 13 Aug 2022 08:24:57 -0700
</div>
</body>
</html>
